#include <stdlib.h>
#include <stdio.h>
#include <math.h>
#include <string.h>
#include <assert.h>
#include <wchar.h>
#include <SDL/SDL.h>
#include <SDL/SDL_ttf.h>
#include "breder.h"

struct b_arraylist_t {
	int size;
	int length;
	void** datas;
	void (*freeFunc)(void*);
};

struct b_arraylist_t* b_arraylist_new_default() {
	return b_arraylist_new_custom(15, 0);
}

struct b_arraylist_t* b_arraylist_new_custom(int length, void (*freeFunc)(void*)) {
	struct b_arraylist_t* data = (struct b_arraylist_t*) calloc(1, sizeof(struct b_arraylist_t));
	if (!data) {
		return 0;
	}
	data->datas = (void**) calloc(length, sizeof(void*));
	if (!data->datas) {
		free(data);
		return 0;
	}
	data->length = length;
	data->size = 0;
	data->freeFunc = freeFunc;
	return data;
}

void b_arraylist_free(struct b_arraylist_t* self) {
	b_arraylist_clear(self);
	free(self->datas);
	free(self);
}

b_arraylist_error_t b_arraylist_add(struct b_arraylist_t* data, void* element) {
	if (data->size == data->length) {
		void** datas = (void**) realloc(data->datas, data->length * 2 * sizeof(void*));
		if (!datas) {
			return 1;
		}
		data->datas = datas;
		data->length *= 2;
	}
	data->datas[data->size++] = element;
	return 0;
}

void* b_arraylist_get(struct b_arraylist_t* data, int index) {
	if (index < 0 || index >= data->size) {
		return 0;
	}
	return data->datas[index];
}

int b_arraylist_size(struct b_arraylist_t* data) {
	return data->size;
}


	data->size = 0;
}

void** b_arraylist_iterator(struct b_arraylist_t* data) {
	return data->datas;
}

struct b_arrayqueue_t {
	int length;
	void** elements;
	int head;
	int tail;
	int initialCapacity;
};

struct b_arrayqueue_t* b_arrayqueue_new_default() {
	return b_arrayqueue_new_custom(16);
}

struct b_arrayqueue_t* b_arrayqueue_new_custom(int length) {
	struct b_arrayqueue_t* data = (struct b_arrayqueue_t*) calloc(1, sizeof(struct b_arrayqueue_t));
	if (!data) {
		return 0;
	}
	int initialCapacity = 8;
	if (length >= initialCapacity) {
		initialCapacity = length;
		initialCapacity |= (initialCapacity >> 1);
		initialCapacity |= (initialCapacity >> 2);
		initialCapacity |= (initialCapacity >> 4);
		initialCapacity |= (initialCapacity >> 8);
		initialCapacity |= (initialCapacity >> 16);
		initialCapacity++;
		if (initialCapacity < 0) {
			initialCapacity = initialCapacity >> 1;
		}
	}
	data->elements = (void**) calloc(initialCapacity, sizeof(void*));
	if (!data->elements) {
		free(data);
		return 0;
	}
	data->length = length;
	data->initialCapacity = initialCapacity;
	return data;
}

void b_arrayqueue_free(struct b_arrayqueue_t* self) {
	free(self->elements);
	free(self);
}

b_arrayqueue_error_t b_arrayqueue_add(struct b_arrayqueue_t* self, void* element) {
	if (((self->tail + 1) % self->length) == self->head) {
		int newCapacity = self->length << 1;
		void** elements = (void**) realloc(self->elements, newCapacity * sizeof(void*));
		if (!elements) {
			return 1;
		}
		if (self->tail < self->head) {
			memcpy(elements + self->length, elements, self->tail);
			self->tail = self->length + self->tail - 1;
		}
		self->elements = elements;
		self->length = newCapacity;
	}
	self->elements[self->tail] = element;
	self->tail = (self->tail + 1) % self->length;
	return 0;
}

void* b_arrayqueue_get(struct b_arrayqueue_t* self) {
	return self->elements[self->head];
}

int b_arrayqueue_size(struct b_arrayqueue_t* self) {
	if (self->tail >= self->head) {
		return self->tail - self->head;
	} else {
		return self->length - self->head - self->tail - 1;
	}
}

void* b_arrayqueue_remove(struct b_arrayqueue_t* self) {
	int h = self->head;
	void* result = self->elements[h];
	self->head = (h + 1) % (self->length - 1);
	if (((self->tail - self->head) % (self->length - 1)) == 0) {
		b_arrayqueue_clear(self);
	}
	return result;
}

void b_arrayqueue_clear(struct b_arrayqueue_t* self) {
	self->head = self->tail = 0;
	void** elements = (void**) realloc(self->elements, self->initialCapacity * sizeof(void*));
	if (elements) {
		self->elements = elements;
		self->length = self->initialCapacity;
	}
}



static char b64string[] =
		"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

long b_base64_encode(char* to, unsigned char* from, unsigned int len) {
	unsigned char *fromp = from;
	char *top = to;
	unsigned char cbyte;
	unsigned char obyte;
	char end[3];
	for (; len >= 3; len -= 3) {
		cbyte = *fromp++;
		*top++ = b64string[(int) (cbyte >> 2)];
		obyte = (cbyte << 4) & 0x30; /* 0011 0000 */
		cbyte = *fromp++;
		obyte |= (cbyte >> 4); /* 0000 1111 */
		*top++ = b64string[(int) obyte];
		obyte = (cbyte << 2) & 0x3C; /* 0011 1100 */
		cbyte = *fromp++;
		obyte |= (cbyte >> 6); /* 0000 0011 */
		*top++ = b64string[(int) obyte];
		*top++ = b64string[(int) (cbyte & 0x3F)];/* 0011 1111 */
	}
	if (len) {
		end[0] = *fromp++;
		if (--len) {
			end[1] = *fromp++;
		} else {
			end[1] = 0;
		}
		end[2] = 0;
		cbyte = end[0];
		*top++ = b64string[(int) (cbyte >> 2)];
		obyte = (cbyte << 4) & 0x30; /* 0011 0000 */
		cbyte = end[1];
		obyte |= (cbyte >> 4);
		*top++ = b64string[(int) obyte];
		obyte = (cbyte << 2) & 0x3C; /* 0011 1100 */
		if (len) {
			*top++ = b64string[(int) obyte];
		} else {
			*top++ = '=';
		}
		*top++ = '=';
	}
	*top = 0;
	return top - to;
}

long b_base64_decode(unsigned char* to, char* from, unsigned int len) {
	char *fromp = from;
	unsigned char *top = to;
	char *p;
	unsigned char cbyte;
	unsigned char obyte;
	int padding = 0;
	for (; len >= 4; len -= 4) {
		if ((cbyte = *fromp++) == '=') {
			cbyte = 0;
		} else {
			if ((!(p = (char*) memchr(b64string, cbyte, 64)))) {
				return -1;
			}
			cbyte = (p - b64string);
		}
		obyte = cbyte << 2; /* 1111 1100 */
		if ((cbyte = *fromp++) == '=') {
			cbyte = 0;
		} else {
			if ((!(p = (char*) memchr(b64string, cbyte, 64)))) {
				return -1;
			}
			cbyte = p - b64string;
		}
		obyte |= cbyte >> 4; /* 0000 0011 */
		*top++ = obyte;
		obyte = cbyte << 4; /* 1111 0000 */
		if ((cbyte = *fromp++) == '=') {
			cbyte = 0;
			padding++;
		} else {
			padding = 0;
			if ((!(p = (char*) memchr(b64string, cbyte, 64)))) {
				return -1;
			}
			cbyte = p - b64string;
		}
		obyte |= cbyte >> 2; /* 0000 1111 */
		*top++ = obyte;

		obyte = cbyte << 6; /* 1100 0000 */
		if ((cbyte = *fromp++) == '=') {
			cbyte = 0;
			padding++;
		} else {
			padding = 0;
			if ((!(p = (char*) memchr(b64string, cbyte, 64)))) {
				return -1;
			}
			cbyte = p - b64string;
		}
		obyte |= cbyte; /* 0011 1111 */
		*top++ = obyte;
	}
	*top = 0;
	if (len) {
		return -1;
	}
	return (top - to) - padding;
}

struct b_consoleinputstream_t {
};

struct b_consoleoutputstream_t {
};

struct b_consoleinputstream_t* b_consoleinputstream_new() {
	struct b_consoleinputstream_t* self = (struct b_consoleinputstream_t*) calloc(1,
			sizeof(struct b_consoleinputstream_t));
	if (!self) {
		return 0;
	}
	return self;
}

int b_consoleinputstream_read(struct b_consoleinputstream_t* self) {
	return getchar();
}

unsigned char b_consoleinputstream_is_eof(struct b_consoleinputstream_t* self){
	return 0;
}

void b_consoleinputstream_close(struct b_consoleinputstream_t* self) {
	free(self);
}

struct b_consoleoutputstream_t* b_consoleoutputstream_new() {
	struct b_consoleoutputstream_t* self = (struct b_consoleoutputstream_t*) calloc(1,
			sizeof(struct b_consoleoutputstream_t));
	if (!self) {
		return 0;
	}
	return self;
}


